BMValeev/science/QController/comcpp/src/c_class/I2C/stc3115_Driver.cpp
#include "stc3115_Driver.h" 
#include "stc3115_Battery.h"
#include "I2C.h"
using namespace std;
/*
  ===============================================================================
                   ##### STC3115 driver description #####
  ===============================================================================

    This driver is dedicated to STC3115 battery monitoring IC management, it allows
    the stc3115 to be configured, and used without external software.

    ++ stc3115_Driver.c file contains the functions to initialize and report the
            battery state based on STC3115 algorithms.
        - Driver contains its own I2C access functions, they have to be linked with
            I2C driver interface  functions. HW system have to support multi I2C access
            commands to guaranty the data integrity during the 16 bits register R/W
            operations.
        - First part of the driver is composed by driver own functions, which should
            not be accessed by external functions.
        - Then the GasGauge functions are the main interface functions which have to
            be used by the application to initialize, monitor and stop the STC3115
            device.
        - Power saving functions can be used to manage the STC3115 operating mode
            (mixed mode or Voltage mode). These two functions have to be called by
            external program to switch the STC3115 operating mode after STC3115
            initialization.
        - Alarm management functions have to be called to set, stop, get, clear and
            change alarm thresholds after STC3115 initialization.
        - The relaxation register can also be updated after initialization thanks to
            the STC3115_RelxTmrSet.

    ++ stc3115_Driver.h file defines the STC3115 static numbers, driver API
            structures and driver API functions.
        - STC3115_BatteryData_TypeDef is filled by the driver with battery state.
        - STC3115_ConfigData_TypeDef is filled by the driver with battery
            configuration data from stc3115_Battery.h
        - RAMData is the RAM memory map description, used internally of the driver.
            Have no to be modified by external accesses.

    ++ stc3115_Battery.h file is used to describe the battery and application
            configurations.

    ++ stc3115_I2C.c file is used to interface STC3115 driver I2C functions with
        application I2C functions.

    ++ stc3115_I2C.h file contains the stc3115_I2C.c function declarations.

  ===============================================================================
                    ##### How to use STC3115 driver #####
  ===============================================================================

    ++ 	Update 	I2C_Write and I2C_Read functions with application I2C driver functions
        in stc3115_I2C.C file.

    ++	Initialize STC3115 dedicated hardware externally of the driver (I2C
            interface, GPIOs...)

    ++	Fill STC3115_Battery.h with battery and application parameters

    ++  Call one time the the GasGauge_Initialization function

            Parameters:
                - STC3115_ConfigData_TypeDef parameter is filled with STC3115_Battery.h
                    data by the driver
                - STC3115_BatteryData_TypeDef parameter is filled with STC3115 algorithm
                    results and returns the battery state to application

            Function description:
                - Initialize SW structures
                - Check battery history: new battery, swapped battery, already connected
                    battery
                - Initializes STC3115 registers accordingly to battery history
                - Initializes STC3115 RAM memory accordingly to battery history

            Returns:
                - (-1) is returned when STC3115 cannot be accessed: I2C bus is not
                    properly configured or STC3115 is not power supplied
                - (0) is returned if initialization succeeds.

    ++ Call the GasGauge_Task function when battery information is needed:
            every 1 to 30 seconds (no frequency accuracy needed)

            Parameters:
                - STC3115_ConfigData_TypeDef parameter is used in case of STC3115 has to be
                    initialized again
                - STC3115_BatteryData_TypeDef parameter is filled with STC3115 algorithm
                    results and returns the battery state to application

            Function description:
                - Check STC3115, battery and application state
                - if battery is well present battery data are updated
                - Available battery state information are returned

            Returns:
                - (-1) is returned when STC3115 cannot be accessed (I2C bus is busy or
                    STC3115 is not power supplied) or when BATD/CD pin is in high level state.
                - (0) is returned if only battery SOC,Voltage and OCV data are available
                - (1) is returned if every STC3115_BatteryData_TypeDef data are available.

    ++ call the GaSGauge_Stop function during the application switch off sequence
         This will stop the STC3115 and save energy. This will help to recover the
         battery context during the next GasGauge_Initialization function.

    ++ GasGauge_Reset function has not to be used by default.
         This function has to be called only in abnormal use cases.
                - (-1) is returned when STC3115 cannot be stopped
                - (0) is returned if reset operation succeeds

*/


RAMData_TypeDef STC3115::RAMData; // now it is private internal static of the class

/* ---- STC3115 I2C R/W interface --------------------------------------------- */

/*******************************************************************************
* Function Name  : I2C_Write
* Description    : utility function to write several bytes to STC311x registers
* Input          : NumberOfBytes, RegAddress, TxBuffer
* Return         : error status
* Note: I2C multiple write function is recommended to be used. If not available,
* STC3115 registers have to be written by 2-byte words (unless NumberOfBytes=1).
* Byte per byte write does not guaranty the data integrity.
*******************************************************************************/
int STC3115::Write(int NumberOfBytes, uint8_t RegAddress , uint8_t *TxBuffer)
{
    // Result
    int res;
    unsigned int res_;

