BMValeev/science/QController/comcpp/src/c_class/I2C/stc3115_Driver.cpp
#ifdef __linux__
    // I2C instance
    I2C& i2c = I2C::getInstance();

    // Device address as vector
    std::vector<uint8_t> addr;
    addr.push_back(STC3115_SLAVE_ADDRESS_SHIFTED);

    // Construct transmit message
    std::vector<uint8_t> tx_msg(TxBuffer, TxBuffer + NumberOfBytes); // need to check if it copies the data!
    tx_msg.insert(tx_msg.begin(),RegAddress);

    // Send
    res_ = i2c.transaction(addr.front(), tx_msg, 0);
    //res_ = i2c.transaction(addr, tx_msg, 0);
    res = res_ == OK_I2C? OK_STC : !OK_STC;

    return(res);
#else
    return 0;
#endif // __linux__

}

/*******************************************************************************
* Function Name  : STC31xx_Read
* Description    : utility function to read several bytes from STC311x registers
* Input          : NumberOfBytes, RegAddress, , RxBuffer
* Return         : error status
* Note: I2C multiple read function is recommended to be used. If not available,
* STC3115 registers have to be read by 2-byte words (unless NumberOfBytes=1).
* Byte per byte read does not guaranty the data integrity.
*******************************************************************************/
int STC3115::Read(int NumberOfBytes, uint8_t RegAddress , uint8_t *RxBuffer)
{
#ifdef __linux__
    // Result
    int res;
    unsigned int res_;

    // I2C instance
    I2C& i2c = I2C::getInstance();

    // Device address as vector
    std::vector<uint8_t> addr;
    addr.push_back(STC3115_SLAVE_ADDRESS_SHIFTED);

    // Construct transmit message
    std::vector<uint8_t> tx_msg;
    tx_msg.push_back(RegAddress);

    // Send
    res_ = i2c.transaction(addr.front(), tx_msg, static_cast<unsigned int>(NumberOfBytes));
    //res_ = i2c.transaction(addr, tx_msg, static_cast<unsigned int>(NumberOfBytes));
    res = res_ == OK_I2C? OK_STC : !OK_STC;

    // Copy to recieve buffer
    std::vector<unsigned char> rx_msg = i2c.recData();
    std::copy(rx_msg.begin(), rx_msg.end(), RxBuffer);

    return(res);
#else
    return 0;
#endif // __linux__
}

/*******************************************************************************
* Function Name  : STC3115_ReadByte
* Description    : utility function to read the value stored in one register
* Input          : RegAddress: STC3115 register,
* Return         : 8-bit value, or 0 if error
*******************************************************************************/
int STC3115::ReadByte(uint8_t RegAddress)
{
    int value;
    uint8_t data[2];
    int res;

    res = Read(1, RegAddress , data);

    if (res >= 0)
    {
        /* no error */
        value = data[0];
    }
    else
        value = -1;

    return(value);
}

/*******************************************************************************
* Function Name  : STC3115_WriteByte
* Description    : utility function to write a 8-bit value into a register
* Input          : RegAddress: STC3115 register, Value: 8-bit value to write
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::WriteByte(uint8_t RegAddress, uint8_t Value)
{
    int res;
    uint8_t data[2];

    data[0]= Value;
    res = Write(1, RegAddress, data);

    return(res);
}

/*******************************************************************************
* Function Name  : STC3115_ReadWord
* Description    : utility function to read the value stored in one register pair
* Input          : RegAddress: STC3115 register,
* Return         : 16-bit value, or 0 if error
*******************************************************************************/
int STC3115::ReadWord(uint8_t RegAddress)
{
    int value;
    unsigned char data[2];
    int res;

    res = Read(2, RegAddress , data);

    if (res >= 0)
    {
        /* no error */
        value = data[1];
        value = (value <<8) + data[0];
    }
    else
        value = -1;

    return(value);
}

/*******************************************************************************
* Function Name  : STC3115_WriteWord
* Description    : utility function to write a 16-bit value into a register pair
* Input          : RegAddress: STC3115 register, Value: 16-bit value to write
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::WriteWord(uint8_t RegAddress, int Value)
{
    int res;
    unsigned char data[2];

    data[0]= Value & 0xff;
    data[1]= (Value>>8) & 0xff;

    res = Write(2, RegAddress , data);

    return(res);
}

/*******************************************************************************
* Function Name  : STC3115_ReadWord
* Description    : utility function to read the value stored in one register pair
* Input          : RegAddress: STC3115 register, nbr: number of bytes to read
* Return         : 16-bit value, or 0 if error
*******************************************************************************/
int STC3115::ReadBytes(unsigned char *data,uint8_t RegAddress,int nbr)
{
    int res;

    res = Read(nbr, RegAddress , data);

    return(res);
}

/*******************************************************************************
* Function Name  : STC3115_WriteWord
* Description    : utility function to write a 16-bit value into a register pair
* Input          : RegAddress: STC3115 register, Value: 16-bit value to write, nbr: number of bytes to write
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::WriteBytes(uint8_t* data,uint8_t RegAddress,int nbr)
{
    int res;

    res = Write(nbr, RegAddress , data);

    return(res);
}
/* ---- End of I2C R/W interface --------------------------------------------- */


/* ---- Internal functions --------------------------------------------------- */
/*******************************************************************************
* Function Name  : STC3115_Status
* Description    : Read the STC3115 status
* Input          : None
* Return         : status word (REG_MODE / REG_CTRL), -1 if error
*******************************************************************************/
int STC3115::Status()
{
    int value;

    /* first, check the presence of the STC3115 by reading first byte of dev. ID */
    if (ReadByte(STC3115_REG_ID)!= STC3115_ID) return (-1);

