BMValeev/science/QController/comcpp/src/c_class/I2C/stc3115_Driver.cpp
    /* read REG_MODE and REG_CTRL */
    value = ReadWord(STC3115_REG_MODE);
    value &= 0x7fff;

    return (value);
}

/*******************************************************************************
* Function Name  : STC3115_SetParam
* Description    :  initialize the STC3115 parameters
* Input          : rst: init algo param
* Return         : 0
*******************************************************************************/
void STC3115::SetParam(STC3115_ConfigData_TypeDef *ConfigData)
{
    int value;

    /* set GG_RUN=0 before changing algo parameters */
    WriteByte(STC3115_REG_MODE,STC3115_VMODE);

    /* init OCV curve */
    WriteBytes(static_cast<uint8_t*>(ConfigData->OCVOffset), STC3115_REG_OCVTAB, OCVTAB_SIZE);

    /* set alm level if different from default */
    if (ConfigData->Alm_SOC !=0 )
        WriteByte(STC3115_REG_ALARM_SOC,static_cast<uint8_t>(ConfigData->Alm_SOC*2));
    if (ConfigData->Alm_Vbat !=0 )
    {
        value = static_cast<int>(static_cast<long>(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
        WriteByte(STC3115_REG_ALARM_VOLTAGE, static_cast<uint8_t>(value));
    }
    
    /* relaxation timer */
    if (ConfigData->Rsense !=0 )
    {
        value= static_cast<int>(static_cast<long>(ConfigData->RelaxCurrent << 9) / (CurrentFactor / ConfigData->Rsense));   /* LSB=8*5.88uV */
        WriteByte(STC3115_REG_CURRENT_THRES,static_cast<uint8_t>(value));
    }

    /* set parameters if different from default, only if a restart is done (battery change) */
    if (RAMData.reg.CC_cnf !=0 ) WriteWord(STC3115_REG_CC_CNF,RAMData.reg.CC_cnf);
    if (RAMData.reg.VM_cnf !=0 ) WriteWord(STC3115_REG_VM_CNF,RAMData.reg.VM_cnf);

    WriteByte(STC3115_REG_CTRL,0x03);  /*   clear PORDET, BATFAIL, free ALM pin, reset conv counter */
    WriteByte(STC3115_REG_MODE, STC3115_GG_RUN | (STC3115_VMODE * static_cast<uint8_t>(ConfigData->Vmode)) | (STC3115_ALM_ENA * ALM_EN));  /*   set GG_RUN=1, set mode, set alm enable */

    return;
}

/*******************************************************************************
* Function Name  : STC3115_Startup
* Description    :  initialize and start the STC3115 at application startup
* Input          : None
* Return         : 0 if ok, -1 if error
*******************************************************************************/
int STC3115::Startup(STC3115_ConfigData_TypeDef *ConfigData)
{
    int res;
    int ocv;

    /* check STC310x status */
    res = Status();
    if (res<0) return(res);

    /* read OCV */
    ocv=ReadWord(STC3115_REG_OCV);

    SetParam(ConfigData);  /* set STC3115 parameters  */

    /* rewrite ocv to start SOC with updated OCV curve */
    WriteWord(STC3115_REG_OCV,ocv);

    return(0);
}


/*******************************************************************************
* Function Name  : STC3115_Restore
* Description    :  Restore STC3115 state
* Input          : None
* Return         : 
*******************************************************************************/
int STC3115::Restore(STC3115_ConfigData_TypeDef *ConfigData)
{
    int res;

    /* check STC310x status */
    res = Status();
    if (res<0) return(res);

    SetParam(ConfigData);  /* set STC3115 parameters  */

    /* restore SOC from RAM data */
    WriteWord(STC3115_REG_SOC,RAMData.reg.HRSOC);

    return(0);
}

/*******************************************************************************
* Function Name  : STC3115_Powerdown
* Description    :  stop the STC3115 at application power down
* Input          : None
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::Powerdown(void)
{
    int res;

    /* write 0x01 into the REG_CTRL to release IO0 pin open, */
    WriteByte(STC3115_REG_CTRL, 0x01);

    /* write 0 into the REG_MODE register to put the STC3115 in standby mode */
    res = WriteByte(STC3115_REG_MODE, 0);
    if (res!= OK_STC) return (res);

    return (OK_STC);
}

/*******************************************************************************
* Function Name  : STC3115_conv
* Description    : conversion utility 
*  convert a raw 16-bit value from STC3115 registers into user units (mA, mAh, mV, �C)
*  (optimized routine for efficient operation on 8-bit processors such as STM8)
* Input          : value, factor
* Return         : result = value * factor / 4096
*******************************************************************************/
int STC3115::conv(short value, unsigned short factor)
{
    int v;

    v = static_cast<int>((static_cast<long>(value) * factor) >> 11);
    v = (v+1)/2;

    return (v);
}

/*******************************************************************************
* Function Name  : STC3115_ReadBatteryData
* Description    :  utility function to read the battery data from STC3115
*                  to be called every 5s or so
* Input          : ref to BatteryData structure
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::ReadBatteryData(STC3115_BatteryData_TypeDef *BatteryData)
{
    unsigned char data[16];
    int res;
    int value;


    /* read STC3115 registers 0 to 14 */
    res = ReadBytes(data, 0, 15);

    if (res<0) return(res);  /* read failed */

    /* fill the battery status data */
    /* SOC */
    value=data[3]; value = (value<<8) + data[2];
    BatteryData->HRSOC = value;     /* result in 1/512% */
    BatteryData->SOC = (value * 10 + 256) / 512; /* result in 0.1% */

    /* conversion counter */
    value=data[5]; value = (value<<8) + data[4];
    BatteryData->ConvCounter = value;

    /* current */
    value=data[7]; value = (value<<8) + data[6];
    value &= 0x3fff;   /* mask unused bits */
    if (value>=0x2000) value = value - 0x4000;  /* convert to signed value */
    BatteryData->Current = conv(static_cast<int16_t>(value), CurrentFactor/RSENSE);  /* result in mA */

    /* voltage */
    value=data[9]; value = (value<<8) + data[8];
    value &= 0x0fff; /* mask unused bits */
    if (value>=0x0800) value -= 0x1000;  /* convert to signed value */
    value = conv(static_cast<int16_t>(value),VoltageFactor);  /* result in mV */
    BatteryData->Voltage = value;  /* result in mV */

