BMValeev/science/QController/comcpp/src/c_class/I2C/stc3115_Driver.cpp
    /* temperature */
    value=data[10];
    if (value>=0x80) value -= 0x100;  /* convert to signed value */
    BatteryData->Temperature = value*10;  /* result in 0.1�C */

    /* OCV */
    value=data[14]; value = (value<<8) + data[13];
    value &= 0x3fff; /* mask unused bits */
    if (value>=0x02000) value -= 0x4000;  /* convert to signed value */
    value = conv(static_cast<int16_t>(value),VoltageFactor);
    value = (value+2) / 4;  /* divide by 4 with rounding */
    BatteryData->OCV = value;  /* result in mV */

    //  res=STC3115_Read(1, STC3115_REG_RELAX_COUNT, data);
    //  if (res<0) return(res);  /* read failed */
    //  BatteryData->RelaxTimer = data[0];

    return(OK_STC);
}

/*******************************************************************************
* Function Name  : STC3115_ReadRamData
* Description    : utility function to read the RAM data from STC3115
* Input          : ref to RAM data array
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::ReadRamData(unsigned char *RamData)
{
    return ReadBytes(RamData, STC3115_REG_RAM, RAM_SIZE);
}

/*******************************************************************************
* Function Name  : STC3115_WriteRamData
* Description    : utility function to write the RAM data into STC3115
* Input          : ref to RAM data array
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::WriteRamData(uint8_t *RamData)
{
    return WriteBytes(RamData, STC3115_REG_RAM, RAM_SIZE);
}

/*******************************************************************************
* Function Name  : STC3115_CalcRamCRC8
* Description    : calculate the CRC8
* Input          : data: pointer to byte array, n: number of vytes
* Return         : CRC calue
*******************************************************************************/
uint8_t STC3115::CalcRamCRC8(uint8_t *data, int n)
{
    int crc=0;   /* initial value */
    int i, j;

    for (i=0;i<n;i++)
    {
        crc ^= data[i];
        for (j=0;j<8;j++)
        {
            crc <<= 1;
            if (crc & 0x100)  crc ^= 7;
        }
    }
    return(crc & 255);
}

/*******************************************************************************
* Function Name  : STC3115_UpdateRamCRC
* Description    : calculate the RAM CRC
* Input          : none
* Return         : CRC value
*******************************************************************************/
int STC3115::UpdateRamCRC()
{
    uint8_t res;

    res = CalcRamCRC8(RAMData.db,RAM_SIZE-1);
    RAMData.db[RAM_SIZE-1] = res;   /* last byte holds the CRC */
    return(res);
}

/*******************************************************************************
* Function Name  : STC3115_InitRamData
* Description    : Init the STC3115 RAM registers with valid test word and CRC
* Input          : STC3115_ConfigData_TypeDef structure
* Return         : none
*******************************************************************************/
void STC3115::InitRamData(STC3115_ConfigData_TypeDef *ConfigData)
{
    int index;
    //Set full RAM tab to 0
    for (index=0;index<RAM_SIZE;index++)
        RAMData.db[index]=0;
    //Fill RAM regs
    RAMData.reg.TstWord=RAM_TSTWORD;  /* Fixed word to check RAM integrity */
    RAMData.reg.CC_cnf = static_cast<int16_t>(ConfigData->CC_cnf);
    RAMData.reg.VM_cnf = static_cast<int16_t>(ConfigData->VM_cnf);
    /* update the crc */
    UpdateRamCRC();
}

/* ---- End of Internal functions --------------------------------------------------- */

/* ---- Driver interface functions -------------------------------------------------- */


/*******************************************************************************
* Function Name  : STC3115_Initialization
* Description    : Start the STC3115 battery tracking algorithm system
* Input          : algo parameters in stc3115_Battery.h file
* Return         : 0 is ok, -1 if STC3115 not found or I2C error
* Affect         : Initializes ConfigData and returns battery early status in BatteryData
*******************************************************************************/
int STC3115::Init(STC3115_ConfigData_TypeDef *ConfigData,STC3115_BatteryData_TypeDef *BatteryData)
{
    int res,loop;
    int OCVOffset[16] = OCV_OFFSET_TAB;

    /*** Fill configuration structure parameters ***/

    ConfigData->Vmode = VMODE;

    if(RSENSE!=0)	ConfigData->Rsense = RSENSE;
    else ConfigData->Rsense = 10; // default value to avoid division by 0

    ConfigData->CC_cnf = (CAPACITY * ConfigData->Rsense * 250 + 6194) / 12389;

    if(RINT!=0)	ConfigData->VM_cnf = (CAPACITY * RINT * 50 + 24444) / 48889;
    else ConfigData->VM_cnf = (CAPACITY * 200 * 50 + 24444) / 48889; // default value

    for(loop=0;loop<16;loop++)
    {
        if(OCVOffset[loop] > 127) OCVOffset[loop] = 127;
        if(OCVOffset[loop] < -127) OCVOffset[loop] = -127;
        ConfigData->OCVOffset[loop] = static_cast<uint8_t>(OCVOffset[loop]);
    }

    ConfigData->Cnom = CAPACITY;
    ConfigData->RelaxCurrent = CAPACITY / 20;

    ConfigData->Alm_SOC = ALM_SOC;
    ConfigData->Alm_Vbat = ALM_VBAT;


    /*** Initialize Gas Gauge system ***/

    /*Battery presence status init*/
    BatteryData->Presence = 1;

    /* check RAM data validity */
    ReadRamData(RAMData.db);

    if ( (RAMData.reg.TstWord != RAM_TSTWORD) || (CalcRamCRC8(RAMData.db,RAM_SIZE)!=0) )
    {
        /* RAM invalid */
        InitRamData(ConfigData);
        res=Startup(ConfigData);  /* return -1 if I2C error or STC3115 not present */
    }
    else
    {

        /* check STC3115 status */
        if ( (ReadByte(STC3115_REG_CTRL) & (STC3115_BATFAIL | STC3115_PORDET)) != 0 )
        {
            res=Startup(ConfigData);  /* return -1 if I2C error or STC3115 not present */
        }
        else
        {
            res=Restore(ConfigData); /* recover from last SOC */
        }
    }

    //Update RAM status
    RAMData.reg.STC3115_Status = STC3115_INIT;
    UpdateRamCRC();
    WriteRamData(RAMData.db);

    return(res);    /* return -1 if I2C error or STC3115 not present */
}

