BMValeev/science/QController/comcpp/src/c_class/I2C/stc3115_Driver.cpp
/*******************************************************************************
* Function Name  : GasGauge_Reset
* Description    : Reset the Gas Gauge system, this function must not be used frequently
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
int STC3115::Reset()
{
    int res;

    /* reset RAM */
    RAMData.reg.TstWord=0;
    RAMData.reg.STC3115_Status = 0;
    res = WriteRamData(RAMData.db);
    if(res != OK_STC) return res;
    /* reset STC3115*/
    res = WriteByte(STC3115_REG_CTRL, STC3115_PORDET);  /*   set soft POR */

    return res;
}



/*******************************************************************************
* Function Name  : GasGauge_Stop
* Description    : Stop the Gas Gauge system and save the context in STC3115 RAM
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
int STC3115::Stop()
{
    int res;

    /*Save context in RAM*/
    ReadRamData(RAMData.db);
    RAMData.reg.STC3115_Status = STC3115_POWERDN;
    /* update the crc */
    UpdateRamCRC();
    WriteRamData(RAMData.db);

    /*STC3115 Power down*/
    res=Powerdown();
    if (res!=0) return (-1);  /* error */

    return(0);
}



/*******************************************************************************
* Function Name  : GasGauge_Task
* Description    : Periodic Gas Gauge task, to be called periodically (every 1 to 60 seconds)
* Input          : STC315 ConfigData structure filled by GasGauge_Initialization function
* Return         : 1 if data available, 0 if no data, -1 if error
* Affect         : Fill the BatteryData structure with updated battery status
*******************************************************************************/
int STC3115::Task(STC3115_ConfigData_TypeDef *ConfigData,STC3115_BatteryData_TypeDef *BatteryData)
{
    int res;

    /* ----------------------------- System state verification ---------------------------- */
    /*Read STC3115 status registers */
    res=Status();

    if (res<0) return(res);  /* return if I2C error or STC3115 not responding */
    BatteryData->status = res;

    /* check STC3115 RAM status (battery has not been changed) */
    ReadRamData(RAMData.db);
    if ( (RAMData.reg.TstWord!= RAM_TSTWORD) || (CalcRamCRC8(RAMData.db,RAM_SIZE)!=0) )
    {
        /* if RAM non ok, reset it and set init state */
        InitRamData(ConfigData);
        RAMData.reg.STC3115_Status = STC3115_INIT;
    }

    /* check battery presence status */
    if ((BatteryData->status & (STC3115_BATFAIL<<8)) != 0)
    {
        /*Battery disconnection has been detected			*/

        /*BATD pin level is over 1.61 or Vcc is below 2.7V	*/
        BatteryData->Presence = 0;

        /*HW and SW state machine reset*/
        Reset();

        return (-1);
    }

    /* check STC3115 running mode*/
    if ((BatteryData->status & STC3115_GG_RUN) == 0)
    {

        if(RAMData.reg.STC3115_Status == (STC3115_RUNNING | STC3115_POWERDN))
            Restore(ConfigData);  /* if RUNNING state, restore STC3115*/
        else
        {
            Startup(ConfigData);  /* if INIT state, initialize STC3115*/
        }

        RAMData.reg.STC3115_Status = STC3115_INIT;
    }

    /* --------------------------------- Read battery data ------------------------------- */

    res = ReadBatteryData(BatteryData);
    if (res!=0) return(-1); /* abort in case of I2C failure */


    /* ------------------------------- battery data report ------------------------------- */
    /* check INIT state */
    if (RAMData.reg.STC3115_Status == STC3115_INIT)
    {
        /* INIT state, wait for current & temperature value available: */
        if (BatteryData->ConvCounter>VCOUNT)
        {
            RAMData.reg.STC3115_Status = STC3115_RUNNING;
            /*Battery is connected*/
            BatteryData->Presence = 1;
        }
    }

    if (RAMData.reg.STC3115_Status != STC3115_RUNNING) /* not running : data partially availalble*/
    {
        BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;
        BatteryData->Current=0;
        BatteryData->Temperature=250;
        BatteryData->RemTime = -1;
    }
    else /*STC3115 running */
    {

        /* ---------- process SW algorithms -------- */

        /*early empty compensation*/
        if (BatteryData->Voltage<APP_CUTOFF_VOLTAGE)
            BatteryData->SOC = 0;
        else if (BatteryData->Voltage<(APP_CUTOFF_VOLTAGE+200))
            BatteryData->SOC = BatteryData->SOC * (BatteryData->Voltage - APP_CUTOFF_VOLTAGE) / 200;

        /* Battery charge value calculation */
        BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;

        if ((BatteryData->status & STC3115_VMODE) == 0) /* mixed mode only*/
        {

            /*Lately fully compensation*/
            if ((BatteryData->status & STC3115_VMODE) == 0) /*running in mixed mode*/
            {

                if(BatteryData->Current > APP_EOC_CURRENT && BatteryData->SOC > 990)
                {
                    BatteryData->SOC = 990;
                    WriteWord(STC3115_REG_SOC,50688);   /* 99% */
                }
            }

            /*Remaining time calculation*/
            if(BatteryData->Current < 0)
            {
                BatteryData->RemTime = (BatteryData->RemTime * 4 + BatteryData->ChargeValue / BatteryData->Current * 60 ) / 5;
                if( BatteryData->RemTime  < 0)
                    BatteryData->RemTime = -1; /* means no estimated time available */
            }
            else
                BatteryData->RemTime = -1; /* means no estimated time available */

        }
        else /* voltage mode only */
        {
            BatteryData->Current=0;
            BatteryData->RemTime = -1;
        }

        //SOC min/max clamping
        if(BatteryData->SOC>1000) BatteryData->SOC = MAX_SOC;
        if(BatteryData->SOC<0) BatteryData->SOC = 0;

