BMValeev/science/QController/comcpp/src/c_class/I2C/stc3115_Driver.cpp
    }

    /* save SOC */
    RAMData.reg.HRSOC = static_cast<int16_t>(BatteryData->HRSOC);
    RAMData.reg.SOC = static_cast<int8_t>((BatteryData->SOC+5)/10);
    UpdateRamCRC();
    WriteRamData(RAMData.db);

    if (RAMData.reg.STC3115_Status==STC3115_RUNNING)
        return(1);
    else
        return(0);  /* only SOC, OCV and voltage are valid */
}

/*******************************************************************************
* Function Name  : STC3115_SetPowerSavingMode
* Description    : Set the power saving mode
* Input          : None
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::SetPowerSavingMode()
{
    int res;

    /* Read the mode register*/
    res = ReadByte(STC3115_REG_MODE);

    /* Set the VMODE bit to 1 */
    res = WriteByte(STC3115_REG_MODE, static_cast<uint8_t>(res | STC3115_VMODE));
    if (res!= OK_STC) return (res);

    return (OK_STC);
}

/*******************************************************************************
* Function Name  : STC3115_StopPowerSavingMode
* Description    : Stop the power saving mode
* Input          : None
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::StopPowerSavingMode()
{
    int res;

    /* Read the mode register*/
    res = ReadByte(STC3115_REG_MODE);

    /*STC3115 is in power saving mode by default, cannot be set dynamically in mixed mode.		*/
    /*Change stc3115_Driver.h VMODE parameter, and connect an external sense resistor to STC3115	*/
    if (VMODE != MIXED_MODE) return (!OK_STC);

    /* Set the VMODE bit to 0 */
    res = WriteByte(STC3115_REG_MODE, static_cast<uint8_t>(res & ~STC3115_VMODE));
    if (res!= OK_STC) return (res);

    return (OK_STC);
}


/*******************************************************************************
* Function Name  : STC3115_AlarmSet
* Description    : Set the alarm function
* Input          : None
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::AlarmSet()
{
    int res;

    /* Read the mode register*/
    res = ReadByte(STC3115_REG_MODE);

    /* Set the ALM_ENA bit to 1 */
    res = WriteByte(STC3115_REG_MODE, static_cast<uint8_t>(res | STC3115_ALM_ENA));
    if (res!= OK_STC) return (res);

    return (OK_STC);
}


/*******************************************************************************
* Function Name  : STC3115_AlarmStop
* Description    : Stop the alarm function
* Input          : None
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::AlarmStop(void)
{
    int res;

    /* Read the mode register*/
    res = ReadByte(STC3115_REG_MODE);

    /* Set the ALM_ENA bit to 0 */
    res = WriteByte(STC3115_REG_MODE, static_cast<uint8_t>(res & ~STC3115_ALM_ENA));
    if (res!= OK_STC) return (res);

    return (OK_STC);
}


/*******************************************************************************
* Function Name  : STC3115_AlarmGet
* Description    : Return the ALM status
* Input          : None
* Return         : ALM status 00 : no alarm 
*                             01 : SOC alarm
*                             10 : Voltage alarm
*                             11 : SOC and voltage alarm
*******************************************************************************/
int STC3115::AlarmGet(void)
{
    int res;

    /* Read the mode register*/
    res = ReadByte(STC3115_REG_CTRL);
    if (res== -1) return (res);

    res = res >> 5;

    return (res);
}

/*******************************************************************************
* Function Name  : STC3115_AlarmClear
* Description    : Clear the alarm signal
* Input          : None
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::AlarmClear(void)
{
    int res;

    /* clear ALM bits*/
    res = WriteByte(STC3115_REG_CTRL, 0x01);
    if (res!= OK_STC) return (res);

    return (res);
}

/*******************************************************************************
* Function Name  : STC3115_AlarmSetVoltageThreshold
* Description    : Set the alarm threshold
* Input          : int voltage threshold in mV
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::AlarmSetVoltageThreshold(STC3115_ConfigData_TypeDef *ConfigData, int VoltThresh)
{
    int res;
    int value;

    ConfigData->Alm_Vbat = VoltThresh;
    
    value= static_cast<int>(static_cast<long>(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
    res = WriteByte(STC3115_REG_ALARM_VOLTAGE, static_cast<uint8_t>(value));
    if (res!= OK_STC) return (res);

    return (OK_STC);
}

/*******************************************************************************
* Function Name  : STC3115_AlarmSetSOCThreshold
* Description    : Set the alarm threshold
* Input          : int voltage threshold in %
* Return         : error status (OK, !OK)
*******************************************************************************/
int STC3115::AlarmSetSOCThreshold(STC3115_ConfigData_TypeDef *ConfigData, int SOCThresh)
{
    int res;

    ConfigData->Alm_SOC = SOCThresh;
    res = WriteByte(STC3115_REG_ALARM_SOC, static_cast<uint8_t>(ConfigData->Alm_SOC*2));
    if (res!= OK_STC) return (res);

    return (OK_STC);
}

/* ---- End of driver interface functions ------------------------------------------ */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
